### Citation
To acknowledge use of the dataset in publications, please cite the following paper:

F. Maxwell Harper and Joseph A. Konstan. 2015. The MovieLens Datasets: History and Context. ACM Transactions on Interactive Intelligent Systems (TiiS) 5, 4, Article 19 (December 2015), 19 pages. DOI=http://dx.doi.org/10.1145/2827872

In [17]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import os

In [26]:
data_fp = os.path.join('~', 'git', 'netflix_challenge', 'data', 'ml-latest-small')

What questions could we ask about predictions and descriptive?
- make sure data in utf-8

In [27]:
df_tags = pd.read_csv(os.path.join(data_fp, 'tags.csv'))
df_links = pd.read_csv(os.path.join(data_fp, 'links.csv'))
df_movies = pd.read_csv(os.path.join(data_fp, 'movies.csv'))
df_ratings = pd.read_csv(os.path.join(data_fp, 'ratings.csv'))

In [28]:
df_tags.head()

   userId  movieId                      tag   timestamp
0      15      339  sandra 'boring' bullock  1138537770
1      15     1955                  dentist  1193435061
2      15     7478                 Cambodia  1170560997
3      15    32892                  Russian  1170626366
4      15    34162              forgettable  1141391765

In [29]:
df_links.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [30]:
df_movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [31]:
df_ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205